/*
	Составить описание класса прямоугольников со сторонами,
	параллельными осям координат.
	Предусмотреть возможность перемещения прямоугольников на плоскости,
	изменения размеров, построения наименьшего прямоугольника,
	содержащего два заданных прямоугольника, и прямоугольника,
	являющегося общей частью (пересечением) двух прямоугольников.
	Написать программу, демонстрирующую работу с этим классом.
	Программа должна содержать меню, позволяющее осуществить проверку всех методов класса.
*/

#include <iostream>
#include <cstdlib>
#include <cmath>
#include "Rectangle.cpp"

int main() { return 0; }
